Revit 2027 API
FabricationVersionInfo.Reason Property
 The user-specified reason for the change.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Reason { get; }
Public ReadOnly Property Reason As String
	Get
public:
property String^ Reason {
	String^ get ();
}
member Reason : string with get
Property Value
String
See Also
Reference
FabricationVersionInfo Class
Autodesk.Revit.DB Namespace